---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.HostOrientation
source: html/fa674429-b175-bfa5-8d63-45d8b3179983.htm
---
# Autodesk.Revit.DB.FillPattern.HostOrientation Property

Orientation to host layer.

## Syntax (C#)
```csharp
public FillPatternHostOrientation HostOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration